# ÍNDICE
# **ISDI Repsol D4D/D4B**
# Introducción a Python para Análisis de Datos - Sesión 2

### ÍNDICE
1. CREAR CAMPOS NUEVOS EN UN DATAFRAME
3. AGREGAR DATA
4. EJERCICIOS

### Profesor: Juan Martin Bellido (jmbelldo@isdi.education)

---

In [ ]:
# antes de empezar, cargamos librerías (instalamos en caso de ser necesario)
import pandas as pd
import numpy as np

# CREAR CAMPOS NUEVOS EN UN DATAFRAME

In [ ]:
# Importamos df
df_jamesbond = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/jamesbond.csv",index_col="Film")
df_jamesbond.dtypes # la función dtypes permite visualizar las variables incluídas en un dataframe

Year                   int64
Actor                 object
Director              object
Box Office           float64
Budget               float64
Bond Actor Salary    float64
dtype: object

### A partir de operaciones entre campos
---

In [ ]:
# Creamos una nueva columna como resultado de una operación entre dos columnas numéricas en el dataframe
## utilizaremos la función round() para redondear el resultado
df_jamesbond["profitability"]=(df_jamesbond["Box Office"]/df_jamesbond["Budget"]).round()
df_jamesbond.head()

                       Year  ... profitability
Film                         ...
Dr. No                 1962  ...          64.0
From Russia with Love  1963  ...          43.0
Goldfinger             1964  ...          44.0
Thunderball            1965  ...          20.0
Casino Royale          1967  ...           4.0

[5 rows x 8 columns]

In [ ]:
# Creamos una nueva columna como resultado de una operación entre dos columnas de tipo texto en el dataframe
df_jamesbond["Director/Actor"]=df_jamesbond["Director"]+ " / " + df_jamesbond["Actor"]
df_jamesbond.head()

                       Year  ...                Director/Actor
Film                         ...
Dr. No                 1962  ...  Terence Young / Sean Connery
From Russia with Love  1963  ...  Terence Young / Sean Connery
Goldfinger             1964  ...   Guy Hamilton / Sean Connery
Thunderball            1965  ...  Terence Young / Sean Connery
Casino Royale          1967  ...      Ken Hughes / David Niven

[5 rows x 7 columns]

### A partir de una prueba lógica
---

Creamos una nueva columna a partir de una condición *if/else* utilizando la función *np.where()*

```
np.where(condition, value if true, value if false)
```

In [ ]:
# Creamos un nuevo campo con valor condicional
## asignamos 1 o 0 en función de si el actor es Daniel Craig o no
df_jamesbond["actor_is_daniel_craig"] = np.where(df_jamesbond["Actor"]=='Daniel Craig',1,0)
df_jamesbond[["Actor","actor_is_daniel_craig"]].head()

                              Actor  actor_is_daniel_craig
Film
Dr. No                 Sean Connery                      0
From Russia with Love  Sean Connery                      0
Goldfinger             Sean Connery                      0
Thunderball            Sean Connery                      0
Casino Royale           David Niven                      0

# AGREGAR DATA

In [ ]:
# Importamos df
df_jamesbond = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/jamesbond.csv",index_col="Film")
df_jamesbond.dtypes

Year                   int64
Actor                 object
Director              object
Box Office           float64
Budget               float64
Bond Actor Salary    float64
dtype: object

### Introducción a agregaciones
---

En el contexto del análisis de datos, agregar data significa realizar cálculos que permitan resumir información, abstrayendo conocimiento de data que se encuentra en estado bruto. *Nota: Se trata del ejercicio que hacemos cada vez que utilizamos una tabla dinámica (pivot table) en Excel*.

Comenzaremos realizando agregaciones al total de las variables incluídas en un dataframe. Para ello, utilizaremos la función *agg()*. 

Siempre que realizamos una operación de agregación, utilizamos al menos una función que establece la operación que buscamos realizar. Estas funciones específicas reciben el nombre de *funciones de agregación*. 

```
objecto.agg(["aggregate function","aggregate function"])
```

*Funciones de agregación*

| Function    | Description                     |
|-------------|---------------------------------|
| count       | Number of non-null observations |
| nunique     | Number of unique values         |
| sum         | Sum of values                   |
| mean        | Mean of values                  |
| median      | Arithmetic median of values     |
| mode        | Mode                            |
| min         | Minimum                         |
| max         | Maximum                         |

In [ ]:
# Agregamos todas las columnas, utilizando las funciones de agregación min y max
df_jamesbond.agg(["max","min"])

     Year           Actor       Director  Box Office  Budget  Bond Actor Salary
max  2015  Timothy Dalton  Terence Young       943.5   206.3               17.9
min  1962    Daniel Craig   Guy Hamilton       250.9     7.0                0.6

In [ ]:
df_jamesbond.agg(["max","min"]).T # el atributo .T nos permite pivotar ("transpose") el df

                              max           min
Year                         2015          1962
Actor              Timothy Dalton  Daniel Craig
Director            Terence Young  Guy Hamilton
Box Office                  943.5         250.9
Budget                      206.3             7
Bond Actor Salary            17.9           0.6

In [ ]:
# A continuación, conteremos número de observaciones no nulas (count) y valores únicos (nunique)
df_jamesbond.agg(["count","nunique"])

         Year  Actor  Director  Box Office  Budget  Bond Actor Salary
count      26     26        26          26      26                 18
nunique    24      7        13          25      26                 17

### Especificando agregaciones para cada campo
---
Normalmente, no buscamos realizar la misma opereación para todas las columnas en un dataframe, sino que buscamos aplicar funciones de agregación específicas para cada variable.

Podemos especificar funciones de agregación específicas para cada campo utilizando un "dictionary".

```
object.agg({
  'col1':["aggregate function","aggregate function"]
  ,'col2':["aggregate function","aggregate function","aggregate function"]
})
```

In [ ]:
# Agregamos la columna "box office", según funciones min(), max() y mean()
df_jamesbond.agg({'Box Office':["min","max","mean"]}).T

              min    max        mean
Box Office  250.9  943.5  491.611538

In [ ]:
# Agregamos columnas "Year", "Box Office", utilizando funciones distintas en cada caso
df_jamesbond.agg(
    {
    'Year':["min","max"]
    ,"Box Office":["min","max","mean","sum"]
    })

## observar que el output tendrá valores NaN (vacíos) para la variable Year, ya que no estamos aplicando ciertas funciones sobre esta variable

        Year    Box Office
max   2015.0    943.500000
mean     NaN    491.611538
min   1962.0    250.900000
sum      NaN  12781.900000

### Agregaciones agrupadas
---

Al realizar agregaciones, frecuentemente buscamos operar sobre observaciones agrupadas según una o más variables, de forma tal que obtengamos conocimiento específico para cada grupo. 

El método *groupby()* nos permite agrupar la agregación en una o más dimensiones (variables categóricas).

```
objecto.groupby(["categorial variable","categorial variable"])
```

In [ ]:
# Agregamos salario máximo, según actor y ordenamos
df_jamesbond.groupby("Actor").agg(
    {"Bond Actor Salary":"max"}
).sort_values("Bond Actor Salary", ascending=False)

                Bond Actor Salary
Actor
Pierce Brosnan               17.9
Daniel Craig                 14.5
Roger Moore                   9.1
Timothy Dalton                7.9
Sean Connery                  5.8
George Lazenby                0.6
David Niven                   NaN

In [ ]:
# Agregamos salario máximo y media de box office, según actor
## cambiamos los nombres de las variables agregadas
df = df_jamesbond.groupby("Actor").agg(
    {"Bond Actor Salary":"max"
    ,"Box Office":"mean"}
).sort_values("Bond Actor Salary", ascending=False)

## muchas veces, los nombres que obtenemos por defecto no son representativos de la información que almacenan
df = df.rename(columns={'Bond Actor Salary':'total_bond_salary','Box Office':'total_box_office'})

df # invocamos el objeto

                total_bond_salary  total_box_office
Actor
Pierce Brosnan               17.9        471.650000
Daniel Craig                 14.5        691.475000
Roger Moore                   9.1        422.957143
Timothy Dalton                7.9        282.200000
Sean Connery                  5.8        571.114286
George Lazenby                0.6        291.500000
David Niven                   NaN        315.000000

In [ ]:
# Agregamos múltiples métricas utilizando distintas funciones
## al momento de ordenar, debemos utilizar un tuple para poder especificar (i) variable y (ii) función
df_jamesbond.groupby("Actor").agg(
    {
    "Bond Actor Salary":["max","sum","mean","size"]
    ,"Budget":["max","min"]
    }
).sort_values(("Bond Actor Salary","max"),ascending=False) # al ordenar el df, debemos utilizar un "tuple" para definir criterio

               Bond Actor Salary                       Budget
                             max   sum       mean size    max    min
Actor
Pierce Brosnan              17.9  46.5  11.625000    4  158.3   76.9
Daniel Craig                14.5  25.9   8.633333    4  206.3  145.3
Roger Moore                  9.1  16.9   8.450000    7   91.5   27.7
Timothy Dalton               7.9  13.1   6.550000    2   68.8   56.7
Sean Connery                 5.8  20.3   3.383333    7   86.0    7.0
George Lazenby               0.6   0.6   0.600000    1   37.3   37.3
David Niven                  NaN   0.0        NaN    1   85.0   85.0

In [ ]:
# Podemos utilizar más de una variable al agregar
## en tal caso, las observaciones se agruparán según estos dos campo combinados
df_jamesbond.groupby(["Director","Actor"]).agg(
    {"Box Office":"median"}
)

                                   Box Office
Director           Actor
Guy Hamilton       Roger Moore         397.15
                   Sean Connery        631.45
Irvin Kershner     Sean Connery        380.00
John Glen          Roger Moore         373.80
                   Timothy Dalton      282.20
Ken Hughes         David Niven         315.00
Lee Tamahori       Pierce Brosnan      465.40
Lewis Gilbert      Roger Moore         534.00
                   Sean Connery        514.20
Marc Forster       Daniel Craig        514.20
Martin Campbell    Daniel Craig        581.50
                   Pierce Brosnan      518.50
Michael Apted      Pierce Brosnan      439.50
Peter R. Hunt      George Lazenby      291.50
Roger Spottiswoode Pierce Brosnan      463.20
Sam Mendes         Daniel Craig        835.10
Terence Young      Sean Connery        543.80

# EJERCICIOS

##### EX 1

> Dataset https://data-wizards.s3.amazonaws.com/datasets/dataset_videogames_games.csv

##### Crear un campo (*total_sales*) en el dataframe que englobe las ventas totales en todas las regiones. Crear otro campo (*video_game_segment*) que identifique videojuegos que hayan vendido en total más de 30MM ("top sales") vs. el resto ("not top sales"). Filtrar por videojuegos para la plataforma 'N64' y desplegar columnas; *name*, *platform_code*, *total_sales*, *video_game_segment*.

---

In [ ]:
import pandas as pd
df_videogames = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/dataset_videogames_games.csv")
df_videogames.dtypes

rank               int64
name              object
platform_code     object
year               int64
genre             object
publisher         object
NA_sales         float64
EU_sales         float64
JP_sales         float64
Other_sales      float64
dtype: object

In [ ]:
df_videogames["total_sales"] = df_videogames["NA_sales"] + df_videogames["EU_sales"] + df_videogames["JP_sales"] + df_videogames["Other_sales"]
df_videogames["video_game_segment"] = np.where(df_videogames["total_sales"]>30,'top_sales','not_top_sales') 

cond = df_videogames["platform_code"] == 'N64'
df_videogames[cond][['name','platform_code','total_sales','video_game_segment']].sort_values('total_sales',ascending=False)

                                                   name  ... video_game_segment
0                                            Wii Sports  ...          top_sales
1                                     Super Mario Bros.  ...          top_sales
2                                        Mario Kart Wii  ...          top_sales
3                                     Wii Sports Resort  ...          top_sales
4                              Pokemon Red/Pokemon Blue  ...          top_sales
...                                                 ...  ...                ...
15471                                  World Poker Tour  ...      not_top_sales
15472                        Sousaku Alice to Oujisama!  ...      not_top_sales
15473                                     Empire Deluxe  ...      not_top_sales
15946                                  Spirits & Spells  ...      not_top_sales
15944  SCORE International Baja 1000: The Official Game  ...      not_top_sales

[15947 rows x 4 columns]

##### EX 2 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv

##### EX 2.1 Calcular suma total de facturación (revenue), según sector
##### EX 2.2 Repetir el ejercicio anterior, pero filtrando únicamente por sectores Technology, Energy y Retailing
---

In [ ]:
import pandas as pd
df_fortune = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv")
df_fortune.dtypes

Rank          int64
Company      object
Sector       object
Industry     object
Location     object
Revenue       int64
Profits       int64
Employees     int64
dtype: object

In [ ]:
# EX 2.1
df_fortune.groupby("Sector").agg(
    {"Revenue":"sum"}
).sort_values("Revenue",ascending=False)

                              Revenue
Sector
Financials                    2217159
Health Care                   1614707
Energy                        1517809
Retailing                     1465076
Technology                    1377600
Food, Beverages & Tobacco      555967
Industrials                    497581
Food and Drug Stores           483769
Motor Vehicles & Parts         482540
Telecommunications             461834
Wholesalers                    444800
Transportation                 408508
Aerospace & Defense            357940
Business Services              272195
Materials                      259145
Chemicals                      243897
Household Products             234737
Media                          220764
Hotels, Resturants & Leisure   169546
Engineering & Construction     153983
Apparel                         95968

In [ ]:
# EX 2.2
cond = df_fortune["Sector"].isin(["Technology","Energy","Retailing"])

df_fortune[cond].groupby("Sector").agg(
    {"Revenue":"sum"}
).sort_values("Revenue",ascending=False)

            Revenue
Sector
Energy      1517809
Retailing   1465076
Technology  1377600

##### EX 3 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv

##### Extrear el top 5 planetas (homeworlds) con mayor número de personajes incluídos en el dataset.
---

In [ ]:
import pandas as pd
df_starwars_people = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv")
df_starwars_people.dtypes

name           object
height        float64
mass          float64
hair_color     object
skin_color     object
eye_color      object
birth_year    float64
gender         object
homeworld      object
species        object
sex            object
dtype: object

In [ ]:
df_starwars_people.groupby('homeworld').agg({
  "name":"nunique"   
}).rename(
    {"name":"count_characteres"}
    ,axis='columns'
).sort_values('count_characteres',ascending=False)\
.iloc[:5,]

           count_characteres
homeworld
Naboo                     11
Tatooine                  10
Alderaan                   3
Kamino                     3
Coruscant                  3

##### EX 4 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/dataset_na_who.csv

##### Agregar las siguiente métricas según continente,

*   *Población total*
*   *PIB per cápita medio*
*   *media de % población viviendo por debajo de la línea de la pobreza*

---

In [ ]:
import pandas as pd
df_who = pd.read_csv('https://data-wizards.s3.amazonaws.com/datasets/dataset_na_who.csv')
df_who.dtypes

Country                                                    object
CountryID                                                   int64
ContinentID                                                 int64
Adolescent fertility rate (%)                             float64
Adult literacy rate (%)                                   float64
Gross national income per capita (PPP international $)    float64
Net primary school enrolment ratio female (%)             float64
Net primary school enrolment ratio male (%)               float64
Population (in thousands) total                           float64
Population annual growth rate (%)                         float64
Population in urban areas (%)                             float64
Population living below the poverty line                  float64
Continent                                                  object
dtype: object

In [ ]:
# EX 4
output = df_who.groupby('Continent').agg({
    'Population (in thousands) total':'sum'
    ,'Gross national income per capita (PPP international $)':'mean'
    ,'Population living below the poverty line':'mean'
})

output['Population (in thousands) total'] = round(output['Population (in thousands) total'])
output['Gross national income per capita (PPP international $)'] = round(output['Gross national income per capita (PPP international $)'])
output['Population living below the poverty line'] = round(output['Population living below the poverty line'])

output.sort_values('Population (in thousands) total',ascending=False)

               Population (in thousands) total  ...  Population living below the poverty line
Continent                                       ...
Asia                                 2859153.0  ...                                      28.0
Europe                                880241.0  ...                                       3.0
Africa                                759147.0  ...                                      36.0
Oceania                               714480.0  ...                                      12.0
South America                         453480.0  ...                                      14.0
North America                         441464.0  ...                                       3.0
Middle East                           336867.0  ...                                       2.0

[7 rows x 3 columns]

##### EX 5 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/movies.csv

##### Extrear el top 10 directores con mayor media de IMDB score. Incluir únicamente directores con más de 5 películas dirigidas.
---

In [ ]:
import pandas as pd
df_movies = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/movies.csv",index_col="movie_title")
df_movies.dtypes

color                         object
director_name                 object
num_critic_for_reviews       float64
duration                     float64
director_facebook_likes      float64
actor_3_facebook_likes       float64
actor_2_name                  object
actor_1_facebook_likes       float64
gross                        float64
genres                        object
actor_1_name                  object
num_voted_users                int64
cast_total_facebook_likes      int64
actor_3_name                  object
facenumber_in_poster         float64
plot_keywords                 object
movie_imdb_link               object
num_user_for_reviews         float64
language                      object
country                       object
content_rating                object
budget                       float64
title_year                   float64
actor_2_facebook_likes       float64
imdb_score                   float64
aspect_ratio                 float64
movie_facebook_likes           int64
dtype: object

In [ ]:
# EX 5
output = df_movies.groupby("director_name").agg({
    "imdb_score":"mean"
    ,"movie_title":"count"
    }).rename({
    "imdb_score":"avg_imdb_score"
    ,"movie_title":"total_movies"
},axis='columns')

output[output['total_movies']>5].sort_values('avg_imdb_score',ascending=False).iloc[:10,]

                       avg_imdb_score  total_movies
director_name
Christopher Nolan            8.425000             8
Quentin Tarantino            8.200000             8
Stanley Kubrick              8.050000             6
James Cameron                7.914286             7
Peter Jackson                7.888889             9
Alejandro G. Iñárritu        7.783333             6
David Fincher                7.750000            10
Martin Scorsese              7.660000            20
Wes Anderson                 7.628571             7
Paul Greengrass              7.585714             7

##### EX 6
> Dataset https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv

##### Crear un nuevo campo ("company_size") que segmente a las empresas según cantidad de empleados según el siguiente criterio,

*   *small*, cuando la cantidad de empleados sea menor a 10000
*   *medium*, cuando la cantidad de empleados sea mayor a 10000 y menor a 100000
*   *big*, cuando la cantidad de empleados sea mayor a 100000

##### Calcular mediana de ganancias (profits), según (i) sector y (ii) tamaño de empresa ("company_size")
---

In [ ]:
import pandas as pd
import numpy as np
df_fortune = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv")
df_fortune.dtypes

Rank          int64
Company      object
Sector       object
Industry     object
Location     object
Revenue       int64
Profits       int64
Employees     int64
dtype: object

In [ ]:
# step 1: creating a new column based on conditions
df = df_fortune
df["company_size"] = np.where(
    df["Employees"]>100000,"big"                      # condition 1
    ,np.where(df["Employees"]>10000,"medium","small"  # condition 2
  )
)

# step 2: parsing the new variable into the groupby
df.groupby(["Sector","company_size"]).agg(
    {"Profits":"median"}
)

                                           Profits
Sector                       company_size
Aerospace & Defense          big            5176.0
                             medium          545.0
                             small           182.0
Apparel                      medium          415.5
                             small           174.0
Business Services            big             169.0
                             medium          419.0
                             small           148.0
Chemicals                    medium         1166.0
                             small           144.5
Energy                       medium          874.0
                             small           118.0
Engineering & Construction   medium          128.0
                             small           167.5
Financials                   big           22894.0
                             medium         1224.0
                             small           473.0
Food and Drug Stores         big            3129.5
                             medium          160.5
                             small            26.0
Food, Beverages & Tobacco    big            5452.0
                             medium          554.5
                             small           260.5
Health Care                  big            2129.0
                             medium          427.0
                             small           204.5
Hotels, Resturants & Leisure big            1293.0
                             medium          161.0
                             small         -1394.0
Household Products           big            7036.0
                             medium          325.0
                             small            89.0
Industrials                  big            2406.0
                             medium          272.5
                             small           108.0
Materials                    medium          274.0
                             small            54.0
Media                        big            8382.0
                             medium          151.0
                             small            64.0
Motor Vehicles & Parts       big            4468.0
                             medium          236.0
                             small           182.0
Retailing                    big            1165.0
                             medium          221.5
                             small            86.0
Technology                   big            7246.0
                             medium          401.0
                             small           321.0
Telecommunications           big           13345.0
                             medium          219.0
                             small           685.0
Transportation               big            4844.0
                             medium          427.0
                             small           226.0
Wholesalers                  medium          395.5
                             small            70.5